Version2/TestTool/TestTool.Setup/Requests/MediaConf/SetVideoSourceConfiguration/TC.MC.NVT.20_REQ_01.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trt:SetVideoSourceConfiguration>
      <trt:Configuration token="source1">
        <tt:Name>Source 1</tt:Name>
        <tt:UseCount>0</tt:UseCount>
        <tt:SourceToken>cam1</tt:SourceToken>
        <tt:Bounds x="0" y="0" width="720" height="576"/>
      </trt:Configuration>
      <trt:ForcePersistence>true</trt:ForcePersistence>
    </trt:SetVideoSourceConfiguration>
  </soap:Body>
</soap:Envelope>